[
    {
        "name": "Getting Started",
        "theme": "tertiary",
        "avatar": "duotone star",
        "body": "Web UI is very early in development, as I just started working on Web UI on Sept 28th, 2022. And then made the decision to switch Web UI from being a Rust-based framework to a pure Vanilla JavaScript component library on June 8th, 2024. And all the while only working on this project part time, sometimes only spending a few hours a week, other times going months without touching it.\n\nExpect rapid iteration style development with breaking changes, even in patch version updates, prior to releasing a 1.0 version, which may be sometime in 2025 depending on my prioritizations between this and other passion projects and priorities.\n\nPlease note that updates may be very slow. I work on this along with my other passion projects on a very part time basis, sometimes only putting in a few hours a week, and sometimes going weeks or even months without doing any work. I wish I could work on this stuff full time so I could deliver new features daily, but that's just not in the cards at this point in time.\n\nWeb UI is currently being used for this website, as well as all of my other Stoic Dreams websites.\n\nIf you are fine dealing with frequent breaking changes and would like to start using Web UI for your project, I would appreciate you letting me know what you think about Web UI and what you would like to see in it through either <a data-click=\"feedback\">a Feedback message</a> or in [the Stoic Dreams discord server](https://discord.com/channels/972856291909332993/1025781071608037466 \"Web UI at Stoic Dreams Discord server\") to help me prioritize features and updates based on what people want from Web UI.\n\nI will be updating this website to provide full documentation, but for now you can check out [our Rust-built documentation](https://crates.io/crates/webui \"Web UI rust crate documentation\")."
    },
    {
        "name": "Where is the Documentation",
        "theme": "tertiary",
        "avatar": "duotone star",
        "body": "I expect you may be wondering where this website doesn't contain much documentation. And if you look into the source code you will see more publicly accessible features and components that aren't documented here.\n\nThe reason is quite simple. Web UI is very early in development, and a lot of the work I am doing is experimental and subject to frequent changes or entire re-writes or removal. Additionally, I am working on this project, along with several other personal projects, on a part-time basis, with my full-time job and family time taking higher priorities.\n\nFor these reasons, I have decided to only document features and components once I feel they are ready to be used.\n\nOf course, this doesn't mean I won't still drastically change a feature or component if it's documented. But expect that if I do change a documented feature or component, that the associated documentation will be updated with the change.\n\n- GitHub: [Web UI open-source web development framework.](https://github.com/StoicDreams/WebUI)\n- Rust WebUI Docs: [Developer documentation for Web UI.](https://docs.rs/webui)\n- Crates.io: [Crate information for Web UI.](https://crates.io/crates/webui)"
    }
]